wallCondensationCoupled/testCases/conan/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0 -0.045 0)      // 0
    (2 -0.045 0)      // 1
    (2 -0.045 0.34)   // 2
    (0 -0.045 0.34)   // 3

    (0 0 0)           // 4
    (2 0 0)           // 5
    (2 0 0.34)        // 6
    (0 0 0.34)        // 7

    (0 0.34 0)        // 8
    (2 0.34 0)        // 9
    (2 0.34 0.34)     // 10
    (0 0.34 0.34)     // 11
);

blocks
(
    hex (3 2 1 0 7 6 5 4) (50 1 13) simpleGrading (1 1 1)   // wall block
    hex (7 6 5 4 11 10 9 8) (50 1 78) // topAir block
        simpleGrading (
            1
            1
            ((0.2 0.4 4) (0.7 0.4 1) (0.1 0.12 0.8))
        )
);

edges
(
);

boundary
(

    leftLet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }
    rightLet
    {
        type patch;
        faces
        (
            (1 2 6 5 )
            (5 6 10 9)
        );
    }

    back
    {
        type empty;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
        );
    }
    front
    {
        type empty;
        faces
        (
            (2 6 7 3)
            (6 10 11 7)
        );
    }
    bottomAir_bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    topAir_top
    {
        type wall;
        faces
        (
            (8 9 10 11)
        );
    }

);



mergePatchPairs
(
);

// ************************************************************************* //
