wallCondensationCoupled/testCases/conan/constant/topAir/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//nu              [0 2 -1 0 0 0 0] 1.57e-05;
//D              D   [0 2 -1  0 0 0 0] 0.0001;
Sct            Sct [0 0  0  0 0 0 0] 0.9;

useDFunction   true;

// following order corresponds to order in thermopphysicalProperties speciesDict (H2O ->1 , HE ->2)

//Cp1	           Cp1 [0 2 -2 -1 0 0 0 ] 2076.1;
//Cp2	           Cp2 [0 2 -2 -1 0 0 0 ] 5193.1;


// ************************************************************************* //
