wallCondensationCoupled/testCases/conan/0/AIR
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      AIR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.1551;

boundaryField
{
    leftLet
    {
        type            calculated;
        value           uniform 0.1551;
    }
    front
    {
        type            empty;
    }
    bottomAir_bottom
    {
        type            calculated;
        value           uniform 0.1551;
    }
    rightLet
    {
        type            calculated;
        value           uniform 0.1551;
    }
    topAir_top
    {
        type            calculated;
        value           uniform 0.1551;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
