wallCondensationCoupled/testCases/conan/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftLet
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    bottomAir_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    rightLet
    {
        type            calculated;
        value           uniform 0;
    }
    topAir_top
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
