wallCondensationCoupled/testCases/conan/system/wall/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    h
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.1;
    }
    hFinal
    {
        $h;
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
	momentumPredictor	no;
	nOuterCorrectors	5;
	nCorrectors		1;
	nNonOrthogonalCorrectors	0;
	outerCorrectorResidualControl
	{
	  h
	  {
		  tolerance	1e-5;
		  relTol	0.0;
	  }
	}
}

// ************************************************************************* //
