wallCondensationCoupled/testCases/conan/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (p U H2O T nut rho);
region topAir;

setFormat csv;
surfaceFormat raw;
interpolationScheme cell;

surfaces
(
    xNormal
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            basePoint    (1 0 0); // Overrides default basePoint (0 0 0)
            normalVector $x;      // $z: macro for (0 0 1)
        }
    }

    outlet
    {
        $patchSurface;
        patches     (rightLet);
    }
);

// ************************************************************************* //
