wallCondensationCoupled/testCases/conan/system/topAir/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // topAir
    {
        name    topAirCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0 0 0 )(2 1 0.4);
        }
    }
    {
        name    topAir;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set topAirCellSet;
        }
    }

);

// ************************************************************************* //
